OID = {
    'SysDesc': '.1.3.6.1.2.1.1.1.0',
    # 系统基本信息
    'sysUptime': '.1.3.6.1.6.3.10.2.1.3',  # '.1.3.6.1.2.1.1.3.0',
    # 监控时间
    'SysName': '.1.3.6.1.2.1.1.5.0',
    # 机器名称
    'SysLocation': '.1.3.6.1.2.1.1.6.0',
    # 机器所在位置
    'SysService': '.1.3.6.1.2.1.1.7.0',
    # 系统提供的服务
    'ssCpuIdle': '1.3.6.1.4.1.2021.11.11',
    # CPU 使用率
    'hrProcessorLoad': '.1.3.6.1.2.1.25.3.3.1.2',
    # CPU 核心数
    'hrMemorySize': '.1.3.6.1.2.1.25.2.2.0',
    # 内存容量
    'hrStorageIndex': '.1.3.6.1.2.1.25.2.3.1.1',
    # 内存编号
    'hrStorageDescr': '.1.3.6.1.2.1.25.2.3.1.3',
    # 内存设备描述
    'hrStorageUsed': '.1.3.6.1.4.1.2021.4.6.0',
    # 已用内存
    'memTotalSwap': '.1.3.6.1.4.1.2021.4.3.0',
    # 虚拟内存
    'dskPath': '.1.3.6.1.4.1.2021.9.1.3',
    # 磁盘路径
    'dskTotal': '.1.3.6.1.4.1.2021.9.1.6',
    # 磁盘总容量
    'dskAvail': '.1.3.6.1.4.1.2021.9.1.7',
    # 磁盘可用容量
    'dskPercent': '.1.3.6.1.4.1.2021.9.1.9',
    # 磁盘 使用率
    'IfNumber': '.1.3.6.1.2.1.2.1.0',
    # 网络接口数量
    'IfDescr': '.1.3.6.1.2.1.2.2.1.2',
    # 网络接口信息描述
    'IfType': '.1.3.6.1.2.1.2.2.1.3',
    # 网络接口类型
    'IfSpeed': '.1.3.6.1.2.1.2.2.1.5',
    # 接口当前带宽[bps]
    'IfPhysAddress': '.1.3.6.1.2.1.2.2.1.6',
    # 接口的物理地址
    'IfInOctet': '.1.3.6.1.2.1.2.2.1.10',
    # 接口收到的字节数
    'IfOutOctet': '.1.3.6.1.2.1.2.2.1.16',
    # 接口发送的字节数
    'ifInUcastPkts': '1.3.6.1.2.1.2.2.1.11',
    # 收到包的数量
    'ipInDiscards': '1.3.6.1.2.1.2.2.1.13',
    # 收到并丢弃的包的数量
    'tcpConnTable': '1.3.6.1.2.1.6.13',
    # TCP连接表
    'udpTable': '1.3.6.1.2.1.7.5'
    # UDP连接表

}

SysServiceDict = {
    '72': ['应用层', '网络层']
}
